       IDENTIFICATION DIVISION.
       PROGRAM-ID. CIPHER.
       *> idenify basics about the program
       ENVIRONMENT DIVISION.
       *> what environment specifics it should run in
       DATA DIVISION. 
       *>contains the data the program uses
       WORKING-STORAGE SECTION. 
       01 	THE-MESSAGE 	PIC X(50) VALUE "A TEST FOR ALAN".
       01 	THE-SHIFT		PICTURE IS 9(10).
       PROCEDURE DIVISION.
       MOVE 2 TO THE-SHIFT.

       *> Meat of program 
       DISPLAY THE-MESSAGE.
       DISPLAY FUNCTION ORD ("Z").
       CALL "ENCODE" USING BY CONTENT THE-MESSAGE, THE-SHIFT.
	   STOP RUN.

	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. ENCODE.
	   DATA DIVISION.
	   WORKING-STORAGE SECTION.
	   01	TEMPC		PICTURE IS X(1).
	   01	CHARNUM1	PICTURE IS 9(3).
	   01	CHARNUM2	PICTURE IS 9(3).
	   01	I 			PICTURE IS 9(3).
	   01	LEN 		PICTURE IS 9(36).
	   01	SHIFTEDCN	PICTURE IS 9(3).
	   01	A 			PICTURE IS 9(2).
	   01	Z 			PICTURE IS 9(2).
	   01	LA 			PICTURE IS 9(2).
	   01	LZ 			PICTURE IS 9(2).
	   01 	ENCYRPTION 	PICTURE IS X(50).
	   LINKAGE SECTION.
	   01	SECRET		PICTURE IS X(50).
	   01	SHIFT		PICTURE IS 9(10).
	   
	   PROCEDURE DIVISION USING SECRET, SHIFT. 
	   	MOVE FUNCTION ORD ("A") TO A.
	   	MOVE FUNCTION ORD ("Z") TO Z.
	   	MOVE FUNCTION ORD ("a") TO LA. *> a
	   	MOVE FUNCTION ORD ("z") TO LZ. *> z


   		MOVE 0 TO I.
   		MOVE LENGTH OF SECRET TO LEN. 
   		IF SHIFT > 26 THEN 
   			MOVE FUNCTION MOD (SHIFT, 26) TO SHIFT
   		END-IF
   		IF SHIFT > -1 THEN 
   		PERFORM LEN TIMES 
   			ADD 1 TO I
   			MOVE SHIFT(I:1) TO TEMPC
   			MOVE FUNCTION ORD (TEMPC) TO CHARNUM1
   			*>DISPLAY CHARNUM1, " ", TEMPC
   			MOVE CHARNUM1 TO SHIFTEDCN
   			ADD SHIFT TO SHIFTEDCN
   			IF CHARNUM1 >= A AND CHARNUM1 <= Z THEN 
   				IF SHIFTEDCN <= Z THEN 
   					MOVE SHIFTEDCN TO CHARNUM2
   					*> not here
   				ELSE 	
   					MOVE SHIFTEDCN TO CHARNUM2
   					SUBTRACT 26 FROM CHARNUM2
   					*> NOT HERE
   				END-IF
   			END-IF
   			IF CHARNUM1 >= LA AND CHARNUM1 <= LZ THEN 
   				IF SHIFTEDCN <= LZ THEN 
   					MOVE SHIFTEDCN TO CHARNUM2
   					DISPLAY "THIS"
   				ELSE 
   					MOVE SHIFTEDCN TO CHARNUM2
   					SUBTRACT 26 FROM CHARNUM2
   				END-IF
   			END-IF
   			IF CHARNUM1 = CHARNUM2 THEN 
				MOVE FUNCTION ORD (" ") TO CHARNUM2
			END-IF
			MOVE FUNCTION CHAR (CHARNUM2) TO TEMPC
			DISPLAY CHARNUM2
			STRING TEMP DELIMITED BY SPACES.
					ENCYRPTION DELIMITED BY SPACES
					INTO ENCYRPTION
   		END-PERFORM
   		EXIT PROGRAM. 
	   END PROGRAM ENCODE.


