       IDENTIFICATION DIVISION.
       PROGRAM-ID. CIPHER.
       *> idenify basics about the program
       ENVIRONMENT DIVISION.
       *> what environment specifics it should run in
       DATA DIVISION. 
       *>contains the data the program uses
       WORKING-STORAGE SECTION. 
       01 	THE-MESSAGE 	PIC X(50).
       01 	THE-MESSAGE2 	PIC X(50).
       01 	THE-MESSAGE3 	PIC X(50).
       01 	THE-SHIFT	PIC S9(3) SIGN LEADING SEPARATE.
       01 	THE-SHIFT2	PIC S9(3) SIGN LEADING SEPARATE.
       01 	THE-SHIFT3	PIC S9(3) SIGN LEADING SEPARATE.
       PROCEDURE DIVISION.
       MOVE 8 TO THE-SHIFT.
       MOVE 8 TO THE-SHIFT2.
       MOVE 26 TO THE-SHIFT3.

       *> Meat of program 
       MOVE "BPQA QA I BMAB ABZQVO NZWU ITIV" TO THE-MESSAGE.
       CALL "DECRYPT" USING BY CONTENT THE-MESSAGE, THE-SHIFT.

       MOVE "THIS IS A TEST STRING FROM ALAN" TO THE-MESSAGE2. 
       CALL "ENCRYPT" USING BY CONTENT THE-MESSAGE2, THE-SHIFT2.

       MOVE "HAL" TO THE-MESSAGE3. 
       CALL "SOLVE" USING BY CONTENT THE-MESSAGE3, THE-SHIFT3.
	   STOP RUN.

	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. DECRYPT.
	   DATA DIVISION.
	   WORKING-STORAGE SECTION.
	   01	TEMPC		PICTURE IS X(1).
	   01	CHARNUM1	PICTURE IS 9(3).
	   01	CHARNUM2	PICTURE IS 9(3).
	   01	I 			PICTURE IS 9(3).
	   01	LEN 		PICTURE IS 9(36).
	   01	SHIFTEDCN	PICTURE IS 9(3).
	   01	A 			PICTURE IS 9(2).
	   01	Z 			PICTURE IS 9(2).
	   01	LA 			PICTURE IS 9(2).
	   01	LZ 			PICTURE IS 9(2).
	   01 	DECYRPTION 	PICTURE IS X(50).
	   LINKAGE SECTION.
	   01	SECRET		PICTURE IS X(50).
	   01	SHIFT	PIC S9(3) SIGN LEADING SEPARATE.
	   
	   PROCEDURE DIVISION USING SECRET, SHIFT. 
	   	MOVE FUNCTION ORD ("A") TO A.
	   	MOVE FUNCTION ORD ("Z") TO Z.
	   	MOVE FUNCTION ORD ("a") TO LA. *> a
	   	MOVE FUNCTION ORD ("z") TO LZ. *> z
		MOVE 0 TO I.
   		MOVE LENGTH OF SECRET TO LEN. 

   		IF SHIFT > 26 THEN 
   			MOVE FUNCTION MOD (SHIFT, 26) TO SHIFT
   		END-IF
   		IF SHIFT < 0 THEN 
   			DISPLAY "INVALID"
   			EXIT PROGRAM.
   		
   		PERFORM LEN TIMES 
   			ADD 1 TO I
   			MOVE SECRET(I:1) TO TEMPC
   			MOVE FUNCTION ORD (TEMPC) TO CHARNUM1
   			MOVE CHARNUM1 TO SHIFTEDCN
   			SUBTRACT SHIFT FROM SHIFTEDCN
   			MOVE CHARNUM1 TO CHARNUM2
   			IF CHARNUM1 >= A AND CHARNUM1 <= Z THEN 
   				IF SHIFTEDCN >= A THEN 
   					MOVE SHIFTEDCN TO CHARNUM2
   				ELSE 	
   					MOVE SHIFTEDCN TO CHARNUM2
   					ADD 26 TO CHARNUM2
   				END-IF
   			END-IF
   			IF CHARNUM1 >= LA AND CHARNUM1 <= LZ THEN 
   				IF SHIFTEDCN >= LZ THEN 
   					MOVE SHIFTEDCN TO CHARNUM2
   				ELSE 
   					MOVE SHIFTEDCN TO CHARNUM2
   					ADD 26 TO CHARNUM2
   				END-IF
   			END-IF
   			IF CHARNUM1 = CHARNUM2 AND SHIFT NOT=26 THEN 
				MOVE FUNCTION ORD (" ") TO CHARNUM2
			END-IF
			MOVE FUNCTION CHAR (CHARNUM2) TO TEMPC
	MOVE FUNCTION CONCATENATE (TEMPC, DECYRPTION) TO DECYRPTION
   		END-PERFORM
   		
   		MOVE FUNCTION REVERSE(DECYRPTION) TO DECYRPTION
   		MOVE FUNCTION TRIM (DECYRPTION) TO DECYRPTION
   		DISPLAY "...BOOP BEEP DECYRPTING..."
   		DISPLAY " ".
   		DISPLAY "ORIGINAL: ", SECRET
   		DISPLAY "SECRET:   ",  DECYRPTION
   		EXIT PROGRAM. 
	   END PROGRAM DECRYPT.

	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. ENCRYPT.
	   DATA DIVISION.
	   WORKING-STORAGE SECTION.
	   01	TEMPC		PICTURE IS X(1).
	   01	CHARNUM1	PICTURE IS 9(3).
	   01	CHARNUM2	PICTURE IS 9(3).
	   01	I 			PICTURE IS 9(3).
	   01	LEN 		PICTURE IS 9(36).
	   01	SHIFTEDCN	PICTURE IS 9(3).
	   01	A 			PICTURE IS 9(2).
	   01	Z 			PICTURE IS 9(2).
	   01	LA 			PICTURE IS 9(2).
	   01	LZ 			PICTURE IS 9(2).
	   01 	ENCYRPTION 	PICTURE IS X(50).
	   LINKAGE SECTION.
	   01	SECRET		PICTURE IS X(50).
	   01	SHIFT	PIC S9(3) SIGN LEADING SEPARATE.
	   
	   PROCEDURE DIVISION USING SECRET, SHIFT. 
	   	MOVE FUNCTION ORD ("A") TO A.
	   	MOVE FUNCTION ORD ("Z") TO Z.
	   	MOVE FUNCTION ORD ("a") TO LA. *> a
	   	MOVE FUNCTION ORD ("z") TO LZ. *> z
		MOVE 0 TO I.
   		MOVE LENGTH OF SECRET TO LEN. 

   		IF SHIFT > 26 THEN 
   			MOVE FUNCTION MOD (SHIFT, 26) TO SHIFT
   		END-IF
   		IF SHIFT < 0 THEN 
   			DISPLAY "INVALID"
   			EXIT PROGRAM.
   		
   		PERFORM LEN TIMES 
   			ADD 1 TO I
   			MOVE SECRET(I:1) TO TEMPC
   			MOVE FUNCTION ORD (TEMPC) TO CHARNUM1
   			MOVE CHARNUM1 TO SHIFTEDCN
   			ADD SHIFT TO SHIFTEDCN
   			MOVE CHARNUM1 TO CHARNUM2
   			IF CHARNUM1 >= A AND CHARNUM1 <= Z THEN 
   				IF SHIFTEDCN <= Z THEN 
   					MOVE SHIFTEDCN TO CHARNUM2
   				ELSE 	
   					MOVE SHIFTEDCN TO CHARNUM2
   					SUBTRACT 26 FROM CHARNUM2
   				END-IF
   			END-IF
   			IF CHARNUM1 >= LA AND CHARNUM1 <= LZ THEN 
   				IF SHIFTEDCN <= LZ THEN 
   					MOVE SHIFTEDCN TO CHARNUM2
   				ELSE 
   					MOVE SHIFTEDCN TO CHARNUM2
   					SUBTRACT 26 FROM CHARNUM2
   				END-IF
   			END-IF
   			IF CHARNUM1 = CHARNUM2 AND SHIFT NOT=26 THEN 
				MOVE FUNCTION ORD (" ") TO CHARNUM2
			END-IF
			MOVE FUNCTION CHAR (CHARNUM2) TO TEMPC
	MOVE FUNCTION CONCATENATE (TEMPC, ENCYRPTION) TO ENCYRPTION
   		END-PERFORM
   		
   		MOVE FUNCTION REVERSE(ENCYRPTION) TO ENCYRPTION
   		MOVE FUNCTION TRIM (ENCYRPTION) TO ENCYRPTION
   		DISPLAY "...BEEP BOOP ENCYRPTING..."
   		DISPLAY " ".
   		DISPLAY "ORIGINAL: ", SECRET
   		DISPLAY "SECRET:   ",  ENCYRPTION
   		EXIT PROGRAM. 
	   END PROGRAM ENCRYPT.


	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. SOLVE.
	   DATA DIVISION.
	   WORKING-STORAGE SECTION.
	   01	TEMPC		PICTURE IS X(1).
	   01	CHARNUM1	PICTURE IS 9(3).
	   01	CHARNUM2	PICTURE IS 9(3).
	   01	I 			PICTURE IS 9(3).
	   01	SHIFTCOUNT	PICTURE IS 9(3).
	   01	LEN 		PICTURE IS 9(36).
	   01	SHIFTEDCN	PICTURE IS 9(3).
	   01	A 			PICTURE IS 9(2).
	   01	Z 			PICTURE IS 9(2).
	   01	LA 			PICTURE IS 9(2).
	   01	LZ 			PICTURE IS 9(2).
	   01 	ENCYRPTION 	PICTURE IS X(50).
	   LINKAGE SECTION.
	   01	SECRET		PICTURE IS X(50).
	   01	MAXSHIFT PIC S9(3) SIGN LEADING SEPARATE.
	   
	   PROCEDURE DIVISION USING SECRET, MAXSHIFT. 
	   	MOVE FUNCTION ORD ("A") TO A.
	   	MOVE FUNCTION ORD ("Z") TO Z.
	   	MOVE FUNCTION ORD ("a") TO LA. *> a
	   	MOVE FUNCTION ORD ("z") TO LZ. *> z
		MOVE 0 TO I.
		MOVE MAXSHIFT TO SHIFTCOUNT.
   		MOVE LENGTH OF SECRET TO LEN. 

   		DISPLAY "...BEEP SOLVING BOOP...".
   		DISPLAY " ".
   		IF MAXSHIFT < 0 THEN 
   			DISPLAY "INVALID"
   			EXIT PROGRAM.
		PERFORM MAXSHIFT TIMES    		   		
   		PERFORM LEN TIMES 
   			ADD 1 TO I
   			MOVE SECRET(I:1) TO TEMPC
   			MOVE FUNCTION ORD (TEMPC) TO CHARNUM1
   			MOVE CHARNUM1 TO SHIFTEDCN
   			ADD SHIFTCOUNT TO SHIFTEDCN
   			MOVE CHARNUM1 TO CHARNUM2
   			IF CHARNUM1 >= A AND CHARNUM1 <= Z THEN 
   				IF SHIFTEDCN <= Z THEN 
   					MOVE SHIFTEDCN TO CHARNUM2
   				ELSE 	
   					MOVE SHIFTEDCN TO CHARNUM2
   					SUBTRACT 26 FROM CHARNUM2
   				END-IF
   			END-IF
   			IF CHARNUM1 >= LA AND CHARNUM1 <= LZ THEN 
   				IF SHIFTEDCN <= LZ THEN 
   					MOVE SHIFTEDCN TO CHARNUM2
   				ELSE 
   					MOVE SHIFTEDCN TO CHARNUM2
   					SUBTRACT 26 FROM CHARNUM2
   				END-IF
   			END-IF
   			IF CHARNUM1 = CHARNUM2 AND MAXSHIFT NOT=26 THEN 
				MOVE FUNCTION ORD (" ") TO CHARNUM2
			END-IF
			MOVE FUNCTION CHAR (CHARNUM2) TO TEMPC

	MOVE FUNCTION CONCATENATE (TEMPC, ENCYRPTION) TO ENCYRPTION
   		END-PERFORM
   		
   		MOVE FUNCTION REVERSE(ENCYRPTION) TO ENCYRPTION
   		MOVE FUNCTION TRIM (ENCYRPTION) TO ENCYRPTION
   		
   		DISPLAY "CAESAR ", SHIFTCOUNT, ": ", ENCYRPTION
   		SUBTRACT 1 FROM SHIFTCOUNT
   		MOVE " " TO ENCYRPTION
   		MOVE 0 TO I
   		END-PERFORM
   		EXIT PROGRAM. 
	   END PROGRAM SOLVE.
